{"commentSequence": 17103693, "userLocation": "Ny", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "rick", "status": "approved", "userURL": "NULL", "commentBody": "The Coughlin/ Manning marriage has run its course. Coughlin was very good for the NY Giants as far as its brand. He upheld the classy image of the Giants franchise. Did a lot for the city and for charities.<br/><br/>I feel strongly, though, that Tom Coughlin was VERY fortunate to have been paired with a future HOF QB who was intelligent enough and talented enough to execute his offense. Two years out of that system and Eli Mannig is putting up the best numbers of his career. It's been eye opening.<br/><br/>However, if Coughlin goes, Jerry Reese should go as well. Odell Beckham Jr shouldn't save him. As Carl Banks said, this team is \"a group of independent contractors\". Oft injured free agents (Beason, Schwartz) and star struck nobodies (Donnell, Tye). They hit lightening in a bottle with Victor Cruz and thought they could continue bargain shopping for Eli. Wrong. Under Coughlin and Reese, the teams are now untalented and uptight, striving for perfection when they're really just trying to show they belong. It's not the GREEN ZONE. It's the RED ZONE. Get the right players in the right plays. Watch how Shane Vareen was used in New England and then watch how he was used here.<br/><br/>John Mara must maximize these final Eli Manning years. The odds of finding another QB like this should not be taken lightly and they have been taking it lightly since SB 46. You have the best QB and best receiver in the division, and your 6-10, 7-9? Not good.", "createDate": "1451830074", "recommendations": 3, "updateDate": "1451843547", "commentTitle": "<br/>", "userID": 34698545, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17103693", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1451843547", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17103693, "replyCount": 0, "editorsSelection": false}