{"commentSequence": 17103598, "userLocation": "New York", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "drspock", "status": "approved", "userURL": "NULL", "commentBody": "The fashion of the NFL is to fire the coach when things aren't going well. It's easier than firing the players. But if one looks back at the pre season prognostications most analysts picked the Giants to finish behind Philly and Dallas maybe not make the playoffs, even as a wild card.<br/><br/>The problem then, as now is that the Giants roster is not very strong. On offense they basically have a strong QB and a talented but egotistical wide receiver. But the O line is average at best, even when everyone is healthy and they have no running game.<br/><br/>Defense is where the greatest weaknesses lie. It's not that the Giants are bad, it's that they are at best average. Add to that a secondary beset by injuries and its unreasonable to expect that they would be better than a .500 team. How many pro bowel pics are on the Giants roster?<br/><br/>Each year the division winners and the wild card go on to the playoffs. Everyone else goes home. I could see the Giants focusing on the coach if like Philly they were expected to be much better and fell short. But the Giants are finishing the season about where most analysts thought they would be. So why not get Coughlin some better players and see if he can get them to perform as expected. Otherwise a new coach will find himself with a team that's neither rebuilding nor making that big player move to push them to the next level. ", "createDate": "1451829241", "recommendations": 0, "updateDate": "1451843477", "commentTitle": "<br/>", "userID": 68890766, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17103598", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1451843477", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17103598, "replyCount": 0, "editorsSelection": false}