{"commentSequence": 17216574, "userLocation": "Seattle", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Johan", "status": "approved", "userURL": "NULL", "commentBody": "One huge and important difference in this game vs the game played earlier in the season is the addition of Bobby Wagner. <br/><br/>Both Bobby and his back up middle linebacker (Brock Coyle) were out in the Panther/Seahawk game in October. That meant KJ Wright had to slide over from his outside linebacker position to play middle linebacker (diminishing both positions) and second year linebacker Pierre-Lewis had to play Wright's spot outside. <br/><br/>The Seahawks defense will be much, much better this time around. Bobby Wagner is probably the second best middle linebacker behind only Luke Kuechly. KJ is much better in pass defense and much more experienced. Add to that that Jeremy Lane is back from the injury he suffered in last years Super Bowl, and the growth of CB Deshawn Shead and the Panthers are almost playing a different defense. <br/><br/>The game plan is obvious. Bottle up the run. Double cover Olsen. Make Cam Newton beat the Seahawks defense throwing to his wide receivers. If Cam can do that, hat's off to him. If he can't the Seahawks will be moving on. <br/><br/>I believe this game is the real \"Super Bowl\". Whoever wins this game will run the table. Defense and running the ball wins championships. Both the Panthers and the Seahawks are built for that --the Panthers roster is eerily similar to the Seahawks. <br/><br/>It will be a fun game to watch!", "createDate": "1452736087", "recommendations": 4, "updateDate": "1452746325", "commentTitle": "<br/>", "userID": 74015935, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17216574", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1452746325", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17216574, "replyCount": 0, "editorsSelection": false}