{"commentSequence": 17243639, "userLocation": "Cherry Hill NJ", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "John Smith", "status": "approved", "userURL": "NULL", "commentBody": "JOHN WOODEN Was a basketball coach who lived to 100, one of whose star players was Kareem Abdul Jabbar.  He taught respect, sportsmanship and teamwork, focusing on technical drills.  And his teams won.  His primary goal was to bring out the best in his players  He demanded academic excellence, as he realized that many of the players would leave college and emphasize quick money rather than planning for their futures.  Coach Wooden believed in positive communication that inculcated them with values of humanity, fair play, responsibility to the team and fairness.  Videos of his coaching style and interviews on YouTube show his compassion, kindness and sincerity.  He was a national treasure.  Gooden would have sacrificed a game rather than permit his players to violate the high standards to which he held them.  I could imagine that he would be horrified at the pressures put on school age kids to compete, while being exposed to brutal, potentially lethal injuries as well as aggressive negative coaching styles.  He would also be outraged that young kids are permitted to play football, soccer and other sports in a way that puts their brains and future health at significant risk.  My point in describing him in detail is that it is possible to compete and win over &amp; over while holding the highest standards; while learning self-acceptance and good will toward others.  I think he would demand that kids be prohibited from playing any games using tactics that put their brains at risk.  ", "createDate": "1452957815", "recommendations": 1, "updateDate": "1452981803", "commentTitle": "<br/>", "userID": 35001936, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17243639", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1452981803", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17243639, "replyCount": 0, "editorsSelection": false}