{"commentSequence": 17254131, "userLocation": "excramento", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "cfb cfb", "status": "approved", "userURL": "NULL", "commentBody": "Have a watch of the ESPN Sports Science video on deflate gate.  The one where they use actual science to show that a 2lb deflated ball gave no significant competitive advantage.  It only improved grip by 1.5% and made no difference on speed, range or accuracy in throwing, catching or holding onto the ball while running.<br/><br/>What we haven't seen this year is the promised NFL measurements of ball pressure at the start, half time and end of games.  Probably because those measurements in cold weather games show the same amount of ball deflation just from the weather.  Isn't that embarrassing?<br/><br/>What we have seen is that the fumble rate by Patriots players improved this year, and remain at or near the top of the league.  Another statistic that was attributed incorrectly to deflated balls.<br/><br/>I guess the really uncomfortable moment for the league is yet to come.  When Brady wins his fifth super bowl, the commissioner has to hand him the trophy, and then show up a month later at an appeals court to lose again.", "createDate": "1453052991", "recommendations": 8, "updateDate": "1453055008", "commentTitle": "<br/>", "userID": 60581931, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [{"commentSequence": 17254568, "userLocation": "belgium", "userTitle": "NULL", "parentID": 17254131, "sharing": 1, "userDisplayName": "chris", "status": "approved", "userURL": "NULL", "commentBody": "I have no dog in the fight, except I love the game. Perhaps, one day, you Americans will stop squabbling over how the Patriots came to be so good and simply acknowledge their genius. Brady and Belichick are as dynamic a duo as Einstein and relativity. They are simply the best at what they do in a league set up for mediocrity. Of course, Americans love to see their heroes fall, but does that mean your country has to retract their Pro-Patriot sentiment after rallying around the flag after 9/11. Please, just enjoy what you have here. ", "createDate": "1453056180", "recommendations": 7, "updateDate": "1453067106", "commentTitle": "<br/>", "userID": 26900470, "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/2690/0470/cropped-26900470.jpg?0.9705747889820486", "depth": 2, "replies": [], "permID": "17254131:17254568", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1453067106", "trusted": 0, "commentType": "userReply", "parentUserDisplayName": "cfb cfb", "commentID": 17254568, "replyCount": 0, "editorsSelection": false}], "permID": "17254131", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1453055008", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17254131, "replyCount": 1, "editorsSelection": false}