{"commentSequence": 17258037, "userLocation": "pittsburgh", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "frank", "status": "approved", "userURL": "NULL", "commentBody": "You probably won't see a lot of comparisons between this year's NFL playoffs and the presidential primaries but I just cannot resist remarking on how much the last two Steelers' games mimic the Republican and Democratic primary fights.<br/>Republicans: Pittsburgh versus Cincinnati. Pre game threats, insults and ugly words that had nothing to do with the actual competition. Late hits, illegal hits - dare I say cheap shots executed with the express intention of injuring mother participant. Fans, their judgment and behavior addled by alcohol (ideology) attacking other fans for no other reason than they support a different team. Even last minute theatrics that ultimately backfired.<br/>Democrats: Pittsburgh versus Denver. Pre-game compliments, respectful praise for the opponent. One team heavily favored before the contest, but the other leading on the score board until the very end. No cheap shots, no illegal hits, no serious injuries and very few fouls accessed. After the game, handshakes and sincere compliments for the other team, the losers wishing the winners luck in the next contest. Each participant taking responsibility for their own shortcomings in the contest.<br/>Maybe that's the answer? Let the Republicans fight it out on the field?<br/>Cruz leads the visiting team - from Canada, obviously. Christie on the line. The undercard on the bench screaming, \"Put me in coach!\"<br/>And Trump in the owner's luxury box, blaming everyone else and screaming at the coach:<br/>\"You're FIRED!\"", "createDate": "1453119359", "recommendations": 12, "updateDate": "1453128335", "commentTitle": "<br/>", "userID": 7736087, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17258037", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1453128335", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17258037, "replyCount": 0, "editorsSelection": false}