{"commentSequence": 17261498, "userLocation": "Laconia, NH", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Chico", "status": "approved", "userURL": "NULL", "commentBody": "I for once in my life, think you wrote a nice article regarding the greatness or the Patriots, Bill Belichick and Tom Brady; although, I implore you to do a thorough reading of the Well's report findings, the Patriots rebuttal in context, the comments made by Roger Goodell regarding the Brady hearing and appeal, then the released transcripts which shows not only Goodell lied about what Brady actually said, but shows Goodell is misrepresenting what Brady said and his own investigation's involvement.   The NFL not only leaked misinformation from the start to smear the Patriots and Tom Brady, they ignored facts and went with hypothetical situations with out any evidence.  <br/><br/>It all started with the leak to Chris Mortenson by the NFL office of incorrect information, all of the critics and attacks were based on incorrect leaked information and never once corrected by the NFL office even they knew it was wrong.  When the balls were checked both teams had balls underinflated, but within the limits of the ideal gas law for PSI of pressure gauging.<br/><br/>It's not that New England fans feel persecuted, it's that the critics from day one have made claims of cheating or bending the rules with inaccurate and false information, and never take the time to validate what they are saying with the actual facts.....which usually show the critics are plain wrong.   There is no such thing as bending the rules....either you are within the rules or not......all the crying in the world doesn't change it.", "createDate": "1453145605", "recommendations": 21, "updateDate": "1453157204", "commentTitle": "<br/>", "userID": 23325595, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17261498", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1453157204", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17261498, "replyCount": 0, "editorsSelection": false}