{"commentSequence": 17263497, "userLocation": "NYC", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Mark Levin", "status": "approved", "userURL": "NULL", "commentBody": "The author's biases are naked here: \"The league investigated and issued a report that concluded there was a strong likelihood that Brady knew footballs were being tampered with. A judge subsequently ruled not that Brady was innocent but that the N.F.L. had overstepped its authority in suspending him.\" This is the most insinuating way you can state what happened and still claim to be factual. He could have added in that the court also did not find Brady guilty of murder, although that may be a tad more tangential. It's a very selective accounting of the back and forth. Given a Nobel laureate and a majority of scientists lambasting the NFL's science and data, Brady would have won any court case based on the merits of what actually happened - where evidence rather than politics matter more. Hands down. Not having the opportunity to do so, and keeping the court case about less interesting things like the NFL's authority, is what allows those predisposed to see Brady negatively to still have their fig leaf. Also, saying Brady didn't need to deflate balls or use taped signals to be as good as he is - is not a compliment. It is saying, let me keep my right to call you a cheater and cast a shadow on your reputation, while I acknowledge your undeniable success. No sir, you cannot have your own facts. Like Manning, Brady's reputation and integrity are of paramount importance to him, right up there with success. I wouldn't want to settle either if I hadn't done anything wrong.", "createDate": "1453182620", "recommendations": 12, "updateDate": "1453219325", "commentTitle": "<br/>", "userID": 72071935, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17263497", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1453219325", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17263497, "replyCount": 0, "editorsSelection": false}