{"commentSequence": 17272080, "userLocation": "Stamford, CT", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Swans21", "status": "approved", "userURL": "NULL", "commentBody": "Let me first say that I agree that the NFL is the most conservative league in sport.  The coaches, the commentators … if I have to hear Phil Simms or one of the other announcers say “no choice but to punt/kick a field goal there” …<br/><br/>However, the one issue that the author of the piece ignores is that it is not just the probability that is important, but what is a particular scoring play worth - you need to employ game theory..  Clearly, if teams are converting 2-pt conversions at a 48% clip, and PAT’s at a 94% rate, by expected value theory, teams should always go for two.  But sometimes, certain scoring has more value, which game theory better addresses.<br/><br/>The easiest way to look at this is that if the 2-pt conversion rate was 30%, the proper move according to EV theory would be to always kick the PAT.  But, if you were down 2 pts. with 3 seconds left, you would go for two because the 2 pts have value - a PAT is worthless.<br/><br/>So, the smart move for the Packers was the PAT.  Going for two meant you have a greater than even chance of losing.  The point gets you to OT, where the chances of winning should be even.", "createDate": "1453240678", "recommendations": 0, "updateDate": "1453254400", "commentTitle": "<br/>", "userID": 26203284, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [{"commentSequence": 17296914, "userLocation": "Minneapolis", "userTitle": "NULL", "parentID": 17272080, "sharing": 0, "userDisplayName": "Ryan Curry", "status": "approved", "userURL": "NULL", "commentBody": "Disagree.  For various reasons that greGG noted, the \"should be even\" chance your post entertains is less than even (to what degree unknown?).  So, without going math crazy here, basically you have a 94% chance of having a slightly less than 50% chance of winning.  Therefore game theory might in fact dictate that although more brutal and harsh outcomes are certainly likely, so is winning, and the most mathematically win producing choice would be to go for 2 points.  For instance, if the reasons GB was less than 50% to win in OT noted by greGG amount to a 48% chance then with the PAT factored in they have a 45% chance of winning.  That's less than 48%!", "createDate": "1453411343", "recommendations": 0, "updateDate": "1453411536", "commentTitle": "<br/>", "userID": 64594810, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 2, "replies": [], "permID": "17272080:17296914", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1453411536", "trusted": 0, "commentType": "userReply", "parentUserDisplayName": "Swans21", "commentID": 17296914, "replyCount": 0, "editorsSelection": false}], "permID": "17272080", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1453254400", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17272080, "replyCount": 1, "editorsSelection": false}