{"commentSequence": 17316639, "userLocation": "Bristol, UK", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "James Bleeg", "status": "approved", "userURL": "NULL", "commentBody": "I have been an engineer and researcher in the field for fluid dynamics for 20 years. One of the key areas of uncertainty in this matter is the circumstances surrounding the pressure measurements. It appears as if the robotics professor from MIT has identified a set of conditions that may explain the average pressure readings for both sets of footballs. It also appears that in each instance where there is uncertainty in the measurement circumstances (temperature, gauge used, wetness of Patriots footballs vs Colts footballs, effect of wetness, timing of the measurements) the professor has made an assumption that is favorable to a natural explanation for the pressure readings. Considered individually, each assumption may be reasonable, but taken together they make for an unlikely combination. Further, the professor's analysis cannot explain the unusual variability in the Patriots pressure measurements, variability notably absent from the Colts measurements. And this is to say nothing of separate evidence pointing towards a conspiracy to deflate footballs. <br/><br/>It is possible that the Patriots footballs were not tampered with, but is it likely? Of course not. Amid some uncertainty, it is understandable that Patriots fans and journalists that hail from New England will ignore the probabilities. The fact that a professor from MIT can just as blithely do the same points to the power of human cognitive fallacies like the halo effect and confirmation bias.", "createDate": "1453586848", "recommendations": 11, "updateDate": "1453610293", "commentTitle": "<br/>", "userID": 17112774, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17316639", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1453610293", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17316639, "replyCount": 0, "editorsSelection": false}