{"commentSequence": 17316701, "userLocation": "Queens", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "DavidSmith", "status": "approved", "userURL": "NULL", "commentBody": "Well I can see some people still don’t know the facts:<br/><br/>Indy’s balls were deflated as much as the Pats.  But they started at a higher PSI, were measured in the warm locker warm where the air expanded, and again were measured using inconsistent gauges.<br/><br/>As far as the “texts” - there were none to and from Brady on the phones of the people involved.  Why would someone say “I am the deflator”?  if there is an alleged conspiracy - why would he have to identify himself.   Brady testified under oath that he asked seveal times if they would need his cell phone - the Wells investigators told him “no” - so he destroyed his own phone as most celebs do when they get a new one.   Also the NFL had access to all of Brady’s emails which indicated nothing about deflating footballs - but what’s worse some of his personal emails were leaked by the investigators - so I could easily imagine why Tom would not want his personal texts to his wife and selfies out in the pulbic domain which would surely happend if he handed to Ted Wells.<br/><br/>Kraft agreed to the fine because he is a business man and a conciliator.  That’s also why he agreed to the Spygate sanctions which when you look at Spygate it was much ado about nothing.   It was a technical violation of ambiguous letter from the NFL office that changed the method of filming allowed.   This is all about Patriot envy.", "createDate": "1453587498", "recommendations": 17, "updateDate": "1453610378", "commentTitle": "<br/>", "userID": 73320529, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17316701", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1453610378", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17316701, "replyCount": 0, "editorsSelection": false}