{"commentSequence": 17489542, "userLocation": "NY", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Linda", "status": "approved", "userURL": "NULL", "commentBody": "I just finished reading Concussion.  It's about CTE and Dr. Omalu, who discovered why Mike Webster's (Steeler's) life became so bazaar after his retirement from football.  The NFL tried to destroy Dr. Omalu and went to great lengths to discredit him and destroy his reputation.<br/><br/>I am from Westchester County NY and I graduated from Rutgers, so I am a big fan of Ray Rice.  I would never condone Ray's behavior, but his varied punishment by the NFL, after he pleaded guilty in a court of law,  drives me nuts.  Rice is out of the league and will probably never play again.  Meanwhile, Greg Hardy got his conviction overturned, (perhaps) bought off the victim and has played after committing multiple crimes and threatening to kill the victim.  Goodell's arbitrary and capricious treatment of these men, and others, drives me crazy.  Set rules and live by them.<br/>It is clear that repeated head traumas cause CTE.  Soccer has banned heading the ball for younger kids in organized soccer.  That's a ball, not a weapon like helmet.  It's akin to being in a car accident.  You're going 50 mph and hit a tree, your body inside the car is still going 50 mph until it hits something too.  Now we have airbags.  Used to be you hit the steering wheel or the windshield.  The NFL needs to man up and do something to stop the damage done to it's players  It needs to PAY for these players care after football.<br/>No way is Goodell worth 44 million a year, while players brains rot away.  Man up Roger!", "createDate": "1454906355", "recommendations": 1, "updateDate": "1454906794", "commentTitle": "<br/>", "userID": 60660112, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17489542", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1454906794", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17489542, "replyCount": 0, "editorsSelection": true}