{"commentSequence": 17514529, "userLocation": "Brooklyn", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Paul", "status": "approved", "userURL": "NULL", "commentBody": "I coach middle school age football, and would like to know why anyone would want a kid to step onto a field for the first time at precisely the age when the game becomes fast moving and dangerous?  Without prior training?  <br/><br/>The Boston University study is not a \"guided missle\" as suggested in the column.  The rebuttals published by the Journal Neurology explain my own feelings about some of the problems with the study:<br/>1) Sample size is tiny.<br/>2) All subjects were retired NFL players and not representative of average youth football participants.<br/>3) No control for cognitive deficits predating early entry into tackle football<br/>4) Due to age of subjects, all participated (or not) in youth football as played,   practiced and coached in the period 1960's to 1980's, which does not  account for safer practices implemented since.<br/><br/>3 and/or 4 point stance is necessary to gain a leverage advantage over an opponent.  <br/><br/>Flag football is not the same game as football.  Although it is lots of fun, it is mainly for skill position players.  Part of the beauty of football is that there is room for all types of kids, who can all gain the benefits of the game as long as they work hard, make sacrifices and develop their technique.<br/><br/>The columnist benefits by making his living from watching and commenting on the game, and even plugs his latest book on the topic in this column about football, but bears no risk.  That is not the risk/reward relationship in youth football, in my opinion.", "createDate": "1455064149", "recommendations": 1, "updateDate": "1455064207", "commentTitle": "<br/>", "userID": 58226795, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17514529", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1455064207", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17514529, "replyCount": 0, "editorsSelection": false}