{"commentSequence": 17596115, "userLocation": "New York", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Robert Wagner", "status": "approved", "userURL": "NULL", "commentBody": "So the \"NFL\" or primarily the league office filed to change its tax exempt status to be a taxable entity. Just because a business entity has a taxable or sometimes called \"for profit\" status does by no means indicate it will ever make a profit and have to pay any Federal, State or local taxes. I'm sure that the League's lawyers and tax accountants have already determined that the taxable entity will generate paper losses and therefore not pay income taxes. Tax exempt organizations filings with the IRS are available to the general public. A website called GuideStar provides free access to the reports. This is how activities of charitable organizations are scrutinized by the public. Income tax returns of taxable entities are not generally available to the public. Whoever had an interest in the financial activities of the \"League Office\" will no longer be able to obtain this information. But who cares? The NFL whether you agree or disagree with the controversies is a private enterprise. On the other hand far less scrutiny and enforcement of the tax  exempt sector has most likely resulted in the avoidance of billions if not trillions of dollars in profits that should be taxed. Vast real estate holdings are not taxed as well while the taxpayer is paying for the services afforded to these assets. The worst and least enforced type of non-taxable entities are those designated as religious organizations. ", "createDate": "1455710715", "recommendations": 2, "updateDate": "1455725490", "commentTitle": "<br/>", "userID": 39252709, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17596115", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1455725490", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17596115, "replyCount": 0, "editorsSelection": false}