{"commentSequence": 17751825, "userLocation": "Northampton MA", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Tom Taaffe", "status": "approved", "userURL": "NULL", "commentBody": "I live in one of the most liberal regions of htis supposedly liberal state (Pioneer Valley).  Its also one of the most racially segregated regions in the country. A landscape also segregated by class and educational attainment.  Drive a town away from liberal metropoles like Northampton or Amherst and even the pretense of racial tolerance disappears.   Everyone lives in their homogeneous bubble, with little knowledge or contact, beyond their own racial, class or community lines. <br/><br/>So much so, that when Dem Gov candidate crowed loudly about the success of the economic recovery, a community health survey I was running at the same time said something very different: 60% of residents listed lack of jobs and opportunity as the biggest obstacle to a healthier community. A perspective shared by 69% of the town-level officials, nurses, etc. that I interviewed.  These towns were - on average - 98% white, making them fertile ground for Trump and Sanders and disinclined to agree with the political and media establishment about the state of the economy. <br/><br/>And those were the 'wealthy' towns. Conditions in Black and Latino communities are absolutely desperate. Had they been a part of my survey, the disconnect between elite perspectives on the economy and the voting public would have been even more stark. ", "createDate": "1456870156", "recommendations": 5, "updateDate": "1456870207", "commentTitle": "<br/>", "userID": 54842136, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17751825", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1456870207", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17751825, "replyCount": 0, "editorsSelection": false}