{"commentSequence": 17752611, "userLocation": "NH", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "LostinNH", "status": "approved", "userURL": "NULL", "commentBody": "It seems this NYT author does not understand MA very well. Just because states are designated red or blue (or liberal or conservative), does not mean there are not a large minority of antagonistic voters in each state. <br/><br/>I lived in MA for 14 years and now have lived in NH for almost 20 (also lived in NY and CT). There are many angry right wing voters in MA. How do I know? I have been listening to a right wing radio show out of Boston for over 15 years now and hear what the host and his callers have to say about many subjects.  <br/><br/>I agree with most of what commenter Tom Taafe wrote in his post. That white liberals live in their own communities in MA and would be compared to \"Limosine liberals\" out in Hollywood.  As long as they can live in their lily white sections of Boston, white suburbs and white small towns, they feel good about themselves and their liberal politics. However, if Obama had sent a pack of low income, poorly educated Hispanic illegals into their towns instead of three poor town in MA (Chelsea, Lynn and, I think, New Bedford) back in 2014, those fake liberals would have been screaming \"No way!\". It really comes down to hypocrisy or the old cliché, \"Not in my backyard\".  <br/><br/>The working class whites of MA are mostly Repubs. They do not vote DEM. At least we know how these MA Repubs really think where the wealthy liberals hide their true feelings. Better to get it out in the open and deal with it then hide it behind some nice sounding commentary. ", "createDate": "1456877570", "recommendations": 5, "updateDate": "1456877649", "commentTitle": "<br/>", "userID": 69447055, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17752611", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1456877649", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17752611, "replyCount": 0, "editorsSelection": false}