{"commentSequence": 17778360, "userLocation": "NYC", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Kevin", "status": "approved", "userURL": "NULL", "commentBody": "Finally, the truth is rising to the top, as reflected in the scathing questions directed at Brady's attorney.  The facts fly off the pages of the Wells report, creating a clear-as-day picture of Brady's long history of ordering his poor equipment guys to deflate his footballs: the Patriots' prior reputation as deflators; their ridiculously low fumble rate; the Colts email to the NFL before the game raising the deflation concern; the equipment guy actually being named \"the deflator\"; prior texts discussing Brady's ire when the balls aren't soft; the gameday post-measurement theft of the balls by the poor equipment guy and his ON-CAMERA absconding with them into the bathroom; Brady's showering of gifts on these guys; Brady's texts of concern to them after the story broke; Brady's refusal to cooperate with investigators; Brady's supposedly routine destruction of his phone, during an investigation, in which the texts on that phone had been requested... the list goes on. <br/><br/>Go ahead New England residents and Tom Brady fans, work yourself into a lather, write your polemics, scream about how maybe it was the fwigid, fwigid air that day, brrrrr -- and not the on-camera bathroom visit with the footballs --  that caused (just one team's) balls to deflate.  Uh-huh.  But remember, your children are watching.  At least admit to them there is significant evidence here.  Fine, teach them what \"circumstantial\" means at the same time, but don't pretend this is a witch hunt.  It's not.", "createDate": "1457069155", "recommendations": 25, "updateDate": "1457110865", "commentTitle": "<br/>", "userID": 41888304, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [{"commentSequence": 17787364, "userLocation": "NYC", "userTitle": "NULL", "parentID": 17778360, "sharing": 0, "userDisplayName": "Kevin", "status": "approved", "userURL": "NULL", "commentBody": "And just to make it perfectly clear from my comment above, I consider the equipment guys who worked for the Patriots to be victims here, scapegoats, and their treatment in this case terrible.  Who among us could have resisted Tom Brady's directions and wishes, whether they were explicit or heavily implicit?  That includes the equipment guy who took the balls after the ref measured them before the Colts game and went into the bathroom.  I see the \"Free Brady\" motto circulating.  To me, it is the equipment guys caught up in this who deserve to be freed.  ", "createDate": "1457121372", "recommendations": 9, "updateDate": "1457125676", "commentTitle": "<br/>", "userID": 41888304, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 2, "replies": [], "permID": "17778360:17787364", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1457125676", "trusted": 0, "commentType": "userReply", "parentUserDisplayName": "Kevin", "commentID": 17787364, "replyCount": 0, "editorsSelection": false}], "permID": "17778360", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1457110865", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17778360, "replyCount": 1, "editorsSelection": false}