{"commentSequence": 17786314, "userLocation": "excramento", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "cfb cfb", "status": "approved", "userURL": "NULL", "commentBody": "It's a shame that appeals court judges don't familiarize themselves with available facts before taking on a case.<br/><br/>ESPN did a video for their Sports Science series where they used actual science and measurement to determine that deflated balls offer no competitive advantage.  An elementary school student in Sacramento reproduced the temperature drop in her kitchen, and ended up with a ball that lost 2lbs PSI.  Many prominent scientists have done the math, although several loudly announced flawed results and few of those mea culpa'd.  There was nothing on Brady's phone that the NFL didn't already have and they told him they didn't need it.  The league took extensive pressure measurements this past season throughout games and then declined to publish the results.  Everyone remembers that one guy's nickname was \"the deflator\", but nobody remembers that the other's was \"the inflator\".<br/><br/>Judge Berman pointed out the huge gaps in the logic leading to the suspension.  If nothing else, Brady having superior numbers this past year clearly demonstrates that ball inflation isn't much of a factor, let alone the equivalent of using steroids.<br/><br/>But do go on besmirching the leagues marquee player and team.  After all, all of the drug users, woman and child beaters and drunks in the league are really highlighting what the sport is about.<br/><br/>And tell me again why the Chargers used a stickum towel and only got fined $20k, mostly because they didn't turn it over right away and tried to hide it?", "createDate": "1457113784", "recommendations": 11, "updateDate": "1457118718", "commentTitle": "<br/>", "userID": 60581931, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17786314", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1457118718", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17786314, "replyCount": 0, "editorsSelection": false}