{"commentSequence": 17955188, "userLocation": "Miami", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Expected Value", "status": "approved", "userURL": "NULL", "commentBody": "The honest truth is that this article is part of a strain of malignant racism coming from the left. There its no doubt that our society is in need of cultural change and that there are numerous structural disadvantages and implicit biases that put racial groups such as blacks at a disadvantage. More needs to be done to tear down these barriers to opportunity. The #blacklivesmatter movement is an incredibly powerful force for good bringing historical injustices to the attention of the wider society. In contrast, #checkyourprivilege movement is just fighting racism with racism, attempting to silence those of a specific color and gender without considering the content of their words and actions. This article is a continuation of that trend. Is \"bro\" culture annoying because it has an element of anti-intellectualism? Yes. Is it something I would encourage in my future sons? No. But the author's postulation that it is another manifestation of white patriarchy's attempt to dominate other groups is absurd. It is no different than the valley girl giggling faux-feminine behavior often displayed by groups of women. For a long time, the NYTimes has remained a sanctuary of moderate, reason-based liberalism. It is the intellectual core of the left. If the unsupported, emotion and ideology driven dribble found on certain far-left online magazines starts infecting its pages, the left will quickly find itself as dangerous to the future of this country as the right has been.", "createDate": "1458501251", "recommendations": 4, "updateDate": "1458508253", "commentTitle": "<br/>", "userID": 60664683, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17955188", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1458511853", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17955188, "replyCount": 0, "editorsSelection": false}