{"commentSequence": 17956060, "userLocation": "Earthling", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Cassowary", "status": "approved", "userURL": "NULL", "commentBody": "The Berniebro insult has been perpetuated by Hillary's camp to demonize Sanders supporters as aggressive as she was unable to make that characterization of Bernie himself. It's her attempt to play the gender card and claim victimhood even though she has actually been far more aggressive and dishonest in her attacks on Sanders.<br/><br/>I have been called a Berniebro by Clinton supporters here on the NYT. I have never responded with any negative derogatory term for them. I am not a bro. I'm a woman and a feminist. I don't drink beer. Or watch football. Or use self-tanner. I'm not stupid.<br/><br/>What makes me a so-called \"Berniebro\" to Clinton supporters is I question her ethics and judgement in taking millions from Wall Street for speeches she will never release because there are obviously too damning. I question her neocon tendencies and foreign policy failures. I question her sincerity in constantly changing her stance on major issues to whatever she thinks will win her votes.<br/><br/>All this also makes me a \"Republican troll\", \"sexist\" and a \"Trump supporter\" in addition to a \"Berniebro\" and worse according to some Clinton supporters who prefer to lob insults than address the legitimate areas of criticism or debate on Clinton's political record and character.<br/><br/>The Berniebro label has just become an attack used by some (not all) Clinton supporters to shut down debate and silence critics without addressing the issues.", "createDate": "1458520357", "recommendations": 1, "updateDate": "1458761497", "commentTitle": "<br/>", "userID": 67579030, "picURL": "http://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "17956060", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1458765097", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17956060, "replyCount": 0, "editorsSelection": false}