{"commentSequence": 17954796, "userLocation": "vienna, austria", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "carl bumba", "status": "approved", "userURL": "NULL", "commentBody": "These days, if you're white, if you're male, and especially if you're white and male your opinions are discredited, a prior.  This reverse-discrimination is a delight to Republicans.  I'm hoping that my views are considered, despite my hegemonic handicap.<br/>I think there should be an a posteriori examination of the strong support Hillary is receiving from many older women who consider themselves feminists.  In my opinion, their desire to see the first female president in their own lifetimes is self-centered, considering Hillary's aggressive foreign policy history.  How many women and children is distant lands will perish if we continue our interventionist policies to secure American interests and root-out terrorism?  Our first female president WILL be a significant, symbolic accomplishment - a true milestone.  But if it requires the death of many innocent others outside of this country, I don't believe it's worth it.  If it requires keeping the bottom third of our country in poverty (by standards of most developed countries), I don't think it's worth it.  I hope I'm alive to see the first female US president.  But this is just me.", "createDate": "1458495042", "recommendations": 3, "updateDate": "1458508272", "commentTitle": "<br/>", "userID": 56146795, "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5614/6795/cropped-56146795.jpg?0.771880740743201", "depth": 1, "replies": [{"commentSequence": 17955930, "userLocation": "USA", "userTitle": "NULL", "parentID": 17954796, "sharing": 0, "userDisplayName": "Ami", "status": "approved", "userURL": "NULL", "commentBody": "While I don't disagree with you, I think you severely underestimate what it would mean to the generations of women, especially those my mother's age and older, to see a female President of the United States. Don't call them self-centered for that. Women are often forgotten about or diminished as a discriminated against group. Today still that is overwhelmingly true, in business, politics, science, religion, athletics, everywhere. You also take away from Hilary's incredible accomplishments, which to many in the generations that watched her life from the early 90s till now, are still held in high regard.", "createDate": "1458516685", "recommendations": 0, "updateDate": "1458761470", "commentTitle": "<br/>", "userID": 71821732, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 2, "replies": [], "permID": "17954796:17955930", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1458765070", "trusted": 0, "commentType": "userReply", "parentUserDisplayName": "carl bumba", "commentID": 17955930, "replyCount": 0, "editorsSelection": false}], "permID": "17954796", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1458511872", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17954796, "replyCount": 1, "editorsSelection": false}