{"commentSequence": 18325274, "userLocation": "Columbia, MD", "userTitle": "NULL", "parentID": 18324809, "sharing": 0, "userDisplayName": "Tony R.", "status": "approved", "userURL": "NULL", "commentBody": "The player's union agreed that the commissioner could act as judge in accusations involving rules violations. The standards used to judge evidence in such a setting are going to be different from the standards that are used in Federal or State court. If the players didn't want that, they should have never agreed to the contract. As for the actual evidence of deflation, that has to do with the timing of the pressure readings of the footballs. There was a limited amount of time for the pressure reading to be taken-- that was a reality that the officials were up against. No it was not a controlled laboratory experiment such as physics professors might have longed for-- but it is evidence nonetheless. Everyone in the NFL knew what Brady was doing (it was the Ravens who noticed the balls the Patriots were using in a previous playoff game  were using were relatively deflated, and tipped off the Colts). The text messages that the Patriots equipment man was sending out speak for themselves. If you believe those indicate his innocence, I have a bridge in Brooklyn that I can sell you.  I think the real problem here was the NFL allowing the teams to have so much control over the inflation of the footballs, in the first place. That was an absolutely stupid policy, one that invited mischief to take place.", "createDate": "1461603785", "recommendations": 67, "updateDate": "1461602132", "commentTitle": "<br/>", "userID": 12857895, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "18324809:18325274", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1461605732", "trusted": 0, "commentType": "userReply", "parentUserDisplayName": "X", "commentID": 18325274, "replyCount": 0, "editorsSelection": true}