{"commentSequence": 18325216, "userLocation": "thousand Oaks", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Michael teasdale", "status": "approved", "userURL": "NULL", "commentBody": "I am a Patriots fan and am torn by this ruling.   This event has many levels.  One is what exactly happened.  Were the balls tampered with?  Recently, some studies have shown that the deflation could have happened due to temperature differences on the field.   This has put in doubt the whole foundation for this controversy.  The second is Brady's behavior: destroying his phone and its text messages.  Brady's behavior seems incriminating.  A third level is the commissioner's incompetent history of trying to police this sport and his sanctions against players.   <br/><br/>There are multiple scenarios where Brady and the assistants could have done nothing wrong or illegal but were trying to get pressure levels at the very lowest allowable and then the tempurature did it work.   <br/><br/>All that being said, Brady did not act with transparency and did not seem to fully cooperate with the investigation.  The punishment seems a lot  - 4 games suspension where Rice got 2 for hitting his wife.  Yet highly paid and highly visible athletics have a responsibility to their sport and to their fans to be role model.  Brady was not a role model for integrtity and cooperation with the investigation.    He merits some punishment, but not for the alleged facts which are ambiguous, of the case, but for his behavior during the investigation.", "createDate": "1461603591", "recommendations": 71, "updateDate": "1461601597", "commentTitle": "<br/>", "userID": 66011522, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "18325216", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1461605197", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 18325216, "replyCount": 6, "editorsSelection": true}