{"commentSequence": 18359205, "userLocation": "New York", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "drspock", "status": "approved", "userURL": "NULL", "commentBody": "Two things stand out from this story. First, these men are furious because they defined sports as a male space. But it's not just that women are now in that space. They are acting out the sense that they have lost power over women, all women who they want to define and tell what they can or cannot do. <br/><br/>This is about power and the perceived loss of power. This leads to there second point. What do men often do when they perceive that they have lost power over women? They try and reassert it through sexual violence. Constant threats of rape as well as other acts of violence have defined this male response in many venues. Whether it's the nude picture on the locker, the exchange of pornography in the office, men simply don't understand equality and many refuse to try and understand it.<br/><br/>The response to this needs to come from the athletes that they cover. They need to go beyond 'this sin't acceptable' statements and seriously analyze why men act this way. Until we address this male culture of having power over women the harassment will continue, but worse the culture that goes from harassment to actual assaults, including rape will continue. Changing culture is a constant struggle and these women need more allies in that fight. The new phase of civil rights is the push for real equality for women, not only in sports broadcasting, but across the board.", "createDate": "1461843911", "recommendations": 486, "updateDate": "1461846630", "commentTitle": "<br/>", "userID": 68890766, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "18359205", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1461850230", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 18359205, "replyCount": 1, "editorsSelection": true}