{"commentSequence": 18360263, "userLocation": "Chicago", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Steve Singer", "status": "approved", "userURL": "NULL", "commentBody": "\"Fan\" is short for \"fanatic\". People who behave in such disgusting ways hidden by a wall of anonymity are cowards. But they also feel threatened by an alien presence invading their social space, the \"turf\" reserved for them at some visceral or subconscious level or they wouldn't react this way. Die-hard fans who dismiss the idea that any woman could ever play football are also likely to reject their on-field presence during games.<br/><br/>It's abhorrent. But it mirrors a basic fact of everyday politics. Every group has its insiders and outsiders and a pecking order. Someone who feels threatened by a new member, wants to rise or thinks they are sinking towards the dreaded bottom of the pack attacks someone they perceive to be different or weaker than themselves. It goes back to the cave.<br/><br/>It also mirrors the struggle to integrate women into combat jobs and roles traditionally reserved to men in the armed forces. Male resistance takes many forms depending on the service branch and (if you will) its \"machismo\". Unsurprisingly, it is vilest, most misogynous and stupid in the infantry, Rangers, Marine Corps and one assumes Navy Seals and JSOC (Joint Special Operations Command). But, a woman general is West Point's commandant; its first. And two women just graduated from the Army's Ranger School (washout rate 65%) after enduring more than their fair share of brutal physical challenges and mental testing meted out to all cadets; changing its institutional culture in the process.", "createDate": "1461848022", "recommendations": 59, "updateDate": "1461847458", "commentTitle": "<br/>", "userID": 8562342, "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/8562/342/cropped-8562342.jpg?0.3309058779850602", "depth": 1, "replies": [], "permID": "18360263", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1461851058", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 18360263, "replyCount": 2, "editorsSelection": true}