{"commentSequence": 18386887, "userLocation": "Shanghai", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "JW", "status": "approved", "userURL": "NULL", "commentBody": "I am based in China, and work in marketing for a globally known lifestyle brand.  We are fighting copy cats everyday, and it never ends.  Many Chinese simply do not value intellectual property, and the government makes it very difficult to fight these rogue entities.  They lack creativity in branding and design, and simply steal ideas from others.<br/><br/>When you first enter China, if you are known globally, assume your logos and every possible Chinese brand name you may want have been registered by someone.  They are waiting for you to come so they can charge you a ga-jillion dollars.  The government does not care you own the brand worldwide and have years of sales history. <br/><br/>Assume that when you launch in Tier 1 cities, copy cats will fire up in Tier 2 and Tier 3 cities, selling an inferior product with similar or exact logos, and leeching off your marketing spend in the trend setting areas.  If you are as unfortunate as as some brands have been, these copy cats will be perceived as the real brand and you the fake, especially if your pricing is poor.<br/><br/>Assume that companies will try to negotiate buy outs or mergers with you on a regular basis.  They launch a fake product or bluff a fake launch in the hopes that you pay them X Millions to go away.  However, if you do this, it sets precedent and you should be prepared for a game of whack a mole.  <br/><br/>Assume everyone thinks you are the fake brand unless you have insanely good consistency in branding and messaging.  Welcome to China.", "createDate": "1462077845", "recommendations": 6, "updateDate": "1462133587", "commentTitle": "<br/>", "userID": 62030768, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [{"commentSequence": 18396190, "userLocation": "Seattle, WA", "userTitle": "NULL", "parentID": 18386887, "sharing": 0, "userDisplayName": "Matt", "status": "approved", "userURL": "NULL", "commentBody": "Bingo.<br/><br/>People forget, China is a country where private property of any kind didn't exist for many years. So to expect the Chinese populace to suddenly abide by Western concepts of intellectual property, something which for the most part has never existed in China, is a bit naive. ", "createDate": "1462200475", "recommendations": 0, "updateDate": "1462235630", "commentTitle": "<br/>", "userID": 62327536, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 2, "replies": [], "permID": "18386887:18396190", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1462239230", "trusted": 0, "commentType": "userReply", "parentUserDisplayName": "JW", "commentID": 18396190, "replyCount": 0, "editorsSelection": false}], "permID": "18386887", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1462137187", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 18386887, "replyCount": 1, "editorsSelection": false}