{"commentSequence": 18434161, "userLocation": "Cranford, NJ", "userTitle": "NULL", "parentID": null, "sharing": 1, "userDisplayName": "Mike", "status": "approved", "userURL": "NULL", "commentBody": "I understand the desire to get the call right, in pursuit of some academic definition of integrity, but some of the satisfaction of watching the game is taken away when there's always the possibility that a big play could be called back at any moment. You might even say it harms the integrity of play.<br/><br/>This quickly became obvious in the NHL when it introduced the coach's challenge this year, specifically the ability to challenge a non-call of offsides after the opponent scores a goal. Given the fast and free-flowing nature of play in a hockey game, it was never uncommon for the linesmen to overlook a small infraction at the blue line, and really, unless the goal on the ensuing possession happened immediately on a breakaway or odd-man rush, it would be hard to argue the half a foot head start for the offense made much difference anyway.<br/><br/>This year, though, we've seen goal after goal called back when a coach challenges the non-call and it turns out that the attacking player was half a step offsides. Yes, the call is technically correct, but it's a heavy blow to the integrity and flow of the gameplay. And of course even if it were allowed, it would be meaningless to challenge an improper offsides call, which is no less common than its non-call cousin: there would be no way to reset the game to where it was before the whistle. For a league constantly wringing its hands about lack of offense, this is probably not the best move.", "createDate": "1462470996", "recommendations": 1, "updateDate": "1462471090", "commentTitle": "<br/>", "userID": 53156986, "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5315/6986/cropped-53156986.jpg", "depth": 1, "replies": [], "permID": "18434161", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1462474690", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 18434161, "replyCount": 0, "editorsSelection": false}