{"commentSequence": 18609360, "userLocation": "San Francisco", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "David Parsons", "status": "approved", "userURL": "NULL", "commentBody": "HRC is constantly called to account for her ethics because she sent emails off of official government servers.<br/><br/>I wonder what people would say about Hillary Clinton if she was a casino operator who bankrupted 4 companies and had run an unaccredited for-profit school shut down for fraud for offering students worthless degrees and mountains of taxpayer guaranteed student debt.<br/><br/>Trump is running on a platform of incompetence and illegality.<br/><br/>He wants to overturn decades of post WWII nuclear nonproliferation policies and the NATO alliance, yet had never heard of the nuclear triad before he was asked in the debates. <br/><br/>He wants to bring back Medieval torture despite global treaties banning such as crimes against humanity.<br/><br/>He wants to overturn the First Amendment by executive order.<br/><br/>He wants to be responsible for a $4 trillion federal budget and oversee a $19 trillion economy after bankrupting 4 companies.<br/><br/>He is playing the white man card of assumed competence over an accomplished woman with a record of public service and achievement. <br/><br/>He lies about facts like the unemployment rate to uninformed voters - like claiming the unemployment rate is 45% despite census data and the BLS database that make the claim absurd - unless your 95 year old grandmother and 6 month old baby should be working.<br/><br/>Yet he has the audacity to call HRC crooked. What projection!<br/><br/>The real card Trump is playing is the ignorance card - which is why he loves the uneducated voter.", "createDate": "1463975806", "recommendations": 7, "updateDate": "1464024799", "commentTitle": "<br/>", "userID": 57987015, "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5798/7015/cropped-57987015.jpg?0.2362159366072062", "depth": 1, "replies": [], "permID": "18609360", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1464028399", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 18609360, "replyCount": 0, "editorsSelection": false}