{"commentSequence": 18605233, "userLocation": "NEW JERSEY", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "NSTAN3500", "status": "approved", "userURL": "NULL", "commentBody": "Another telling aspect of Trump's \"leadership\" capabilities, or lack there of, are revealed in Mr. Drapers article. When he is advised by Paul Manafort about being more presidential, Trump \"grew more red-faced\". Is this how a president, especially one with virtually no foreign or economic policy experience, nor military knowledge should act when given sincere advice? Should we expect to see the West Wing deserted of any person whose specific knowledge and experience would be invaluable to just about any other president except this one? This, from the person whose brain is so much smarter than any other person. Is this what we as a country want to see leading us in these troubling times? <br/><br/>I admit that 8 months ago the pickings were less than grand out of the 17 candidates. But lets be honest;  there were one or two who are much more qualified, and much less scary, than what the country now has the GOP's stander-bearer. And when we enter the voting booth on November 8 the stink will be palpable. But we must hold our collective noses and choose the less onerous, and odorous, of the two. We cannot be the country that not once, but twice, elected a black man to our highest office that now is on the cusp of putting a carnival barker and snake oil salesman is his successor.<br/><br/>America, do the right thing again. Keep it great by choosing Hillary Clinton. With all her warts she has ore to offer than a man who asks people if his 16 year-old daughter is \"hot\".", "createDate": "1463926980", "recommendations": 6, "updateDate": "1463948849", "commentTitle": "<br/>", "userID": 60124354, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "18605233", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1463952449", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 18605233, "replyCount": 0, "editorsSelection": false}