{"commentSequence": 19042971, "userLocation": "New York NY", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Muhammad M", "status": "approved", "userURL": "NULL", "commentBody": "I don't understand all the support for Durant on this decision. He was one game away from beating the team he just joined. He had three opportunities to seal the deal, so to speak and he didn't get it done. Now he goes to Warriors and makes a powerful team, more powerful? <br/><br/>This is a weak move from Durant because it shows that he's not ready to win a championship as being the team's star player. Yes, LeBron made a decision to join the Miami Heat, but the Heat prior to LeBron was NOT a recording breaking 73 win team. This here is an embarrassment of riches for the Warriors. And for all this hoopla about Adam Silver's supposed \"support\" for LeBron (controversial officiating in the Finals and Green's Game 5 suspension, which was coming to him - please recall the Western Conference Finals and the game at which he illegally hit Steven Adams), this makes the NBA significantly less competitive, especially in the West. <br/><br/>Instead of having a few great teams being Finals contenders, there is one team on top of the mountain and it's not even the 2016 NBA champions. It's the 2015 Champs, the Warriors, a team with two MVPs in their prime and a starting lineup that is greater in talent than the winningest starting lineup in NBA history. If there's any team that Silver is doing favors for, I'd argue it ain't the Cavs, but the Warriors.", "createDate": "1467726198", "recommendations": 4, "updateDate": "1467724287", "commentTitle": "<br/>", "userID": 68005032, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "19042971", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1467727887", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 19042971, "replyCount": 0, "editorsSelection": false}