{"commentSequence": 19118017, "userLocation": "Maryland", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "JABarry", "status": "approved", "userURL": "NULL", "commentBody": "2017 NYT news story: <br/><br/>Overnight American bombers began an attack on Damascus, Syria while missiles were launched on Tehran, Iran.<br/><br/>Secretary of Defense, Don King, defended President Trump's decision to carpet bomb Damascus last night while simultaneously incinerating Tehran with missiles carrying multiple plutonium bombs.  Mr. King went on to say he didn't think the radiation fallout would make it to the west coast of America, but he conceded that people living as far east as Hawaii \"might want to stay indoors over the next 2 months.\"<br/><br/>Outrage has been expressed by US allies and in capitals around the world.  President Xi Jinping, said \"the Peoples Republic of China condemns the United States' barbaric attacks and will respond accordingly.\"  Other world leaders echoed Chin's reaction.  Secretary Bobby Knight, responded with defiance, announcing the Department of Homeland Security \"is ready to take on any adversaries.\"<br/><br/>President Donald Trump is expected to address the nation tonight.  Details are lacking, but a high level source, on condition of anonymity, said Mr. Trump had left the White House for a secret underground bunker shortly after he gave the order to launch the missiles.<br/><br/>This morning Vice President Chris Christie phoned into the Today Show, told Matt Lauer \"President Ping pong and other sissies should shut up!\"  He went on to say \"President Vlad what's-his-name could expect the same if he doesn't wise up.\"  Mr. Christie refused to say where he was calling from.", "createDate": "1468329907", "recommendations": 22, "updateDate": "1468336533", "commentTitle": "<br/>", "userID": 55063995, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "19118017", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1468340133", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 19118017, "replyCount": 0, "editorsSelection": false}