{"commentSequence": 20341668, "userLocation": "nashville, tennessee", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "rice pritchard", "status": "approved", "userURL": "NULL", "commentBody": "Poland wants to remain Polish. It wants to retain its ancient Catholic religion, culture, and language. It does not want to become just another minor colony of the One World/New World Order globalist elite headquartered in America and Britain. The globalists have turned love of country and a sense of cohesiveness and nationhood that is normal and good into something unnatural and evil by constant vilification and slander and libel against patriots and Loyalists in all Western nations. The common people in Europe and elsewhere in the Western World have finally had enough and are turning to parties like Law and Justice, the Lega Nord, National Front, People's Party, etc. in desperation to save their nations and their heritage and patrimony from being destroyed and engulfed by the globalists who want to melt it all down into a mutant mess ruled by the 0.1% in every nation who have conspired to enslave and exploit their fellow citizens.  These billionaire brigands no longer recognize any loyalty or commonality with their own homelands and their own extended family. The reaction can be a peaceful \"revolution\" with gradual reforms and retrenchment  returning to a natural order of things or it can become all out bloody worldwide insurrection and civil/class war. At this point the self anointed socio-economic elite refuse to acknowledge these cold, hard facts but time is rapidly running out for their One World conspiracy. A new era is beginning, either peacefully or violently.", "createDate": "1478144446", "recommendations": 24, "updateDate": "1478206551", "commentTitle": "<br/>", "userID": 65806828, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [{"commentSequence": 20377428, "userLocation": "DC", "userTitle": "NULL", "parentID": 20341668, "sharing": 1, "userDisplayName": "Mcpollak", "status": "approved", "userURL": "NULL", "commentBody": "And what exactly does it mean for Poland to remain Polish?  In 1939 almost 10% of the population was Jewish, many of whom were from families that had been living in Poland for hundreds of years.  Apparently, that wasn't Polish enough to satisfy the \"common people.\".  Virtually all of my Polish mother's large extended family was wiped out - but not by the Germans. They were wiped out by the Poles, their friends and neighbors who didn't hesitate to turn on them, shoot them in the streets, report on them to the Russians then collaborating with the Nazis at the beginning of WWII, and then to the Nazis who deported them.  <br/><br/>I remember when Solidarity became ascendant. I told my mother how great it was for her native country to be freed from tyranny.  Her response was that it wouldn't last and moreover, the common Poles didn't deserve to live in a free and democratic society - they were too insular, too nativist and superstitious, too anti-semitic.  She had no faith in the ability of common Poles to be good people to any but their own kind.   I was shocked, but I see now she has been proven to be right.  Law &amp; Justice, and  you - and Trump - sound like nothing so much as the Nazis in the 1930s.  ", "createDate": "1478470631", "recommendations": 4, "updateDate": "1478471651", "commentTitle": "<br/>", "userID": 6583117, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 2, "replies": [], "permID": "20341668:20377428", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1478471651", "trusted": 0, "commentType": "userReply", "parentUserDisplayName": "rice pritchard", "commentID": 20377428, "replyCount": 0, "editorsSelection": false}], "permID": "20341668", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1478210151", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 20341668, "replyCount": 1, "editorsSelection": false}