{"commentSequence": 20368809, "userLocation": "Fall River MA", "userTitle": "NULL", "parentID": null, "sharing": 1, "userDisplayName": "edmass", "status": "approved", "userURL": "NULL", "commentBody": "It's pretty discouraging that Left opinion leaders habitually go straight to tocsin ringing when their favorites don't get their way.  A generation ago Liberals advocated incremental improvements in the responsibilities and procedures of governmental institutions.  Now it's like a soap opera politics.  Any policy or institution that are deemed to support \"progressive, democratic, diverse, inclusive values get a free ride.  Any resistance to such policies is seen as \"authoritarian, nativist, even racist\".  <br/><br/>It's just as likely that large pluralities of voters in country just want things to once again work.  Work, as in having an immigration policy, being invaded by millions of uninvited migrants, and doing something about it other than echoing post-modern blather, blaming somebody else, or writing bigger and bigger checks. ", "createDate": "1478387551", "recommendations": 6, "updateDate": "1478399428", "commentTitle": "<br/>", "userID": 1761457, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [{"commentSequence": 20372237, "userLocation": "Rockville, MD", "userTitle": "NULL", "parentID": 20368809, "sharing": 0, "userDisplayName": "JMJackson", "status": "approved", "userURL": "NULL", "commentBody": "Actually, no. It isn't \"just as likely\" once you've listened to what they are saying. Pundits continue to ascribe principles to people who are, in fact, seeking to creat countries in which people who look like them are in charge again. They are happy to express the gross prejudices and ignorance about the wider world that drive their behavior. Then a conservative pundit, politician or commenter steps in to \"interpret\" their words as something more respectable, like a desire for things to \"work again\" (like they did before we had to listen to people not like me.) The fact that you are implicitly defending the status quo of the former Iron Curtain countries should give you pause.", "createDate": "1478422536", "recommendations": 1, "updateDate": "1478471651", "commentTitle": "<br/>", "userID": 47181205, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 2, "replies": [], "permID": "20368809:20372237", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1478471651", "trusted": 0, "commentType": "userReply", "parentUserDisplayName": "edmass", "commentID": 20372237, "replyCount": 0, "editorsSelection": false}], "permID": "20368809", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1478403028", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 20368809, "replyCount": 1, "editorsSelection": false}