{"commentSequence": 20376747, "userLocation": "Warsaw", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Pawel", "status": "approved", "userURL": "NULL", "commentBody": "Vision of Poland presented by the author is not even close to reality.<br/>Law and Justice is neither far-right nor it is nationalist. There are 5 MP's representing nationalist movement in the parliament but there are from lists of Kukiz'15 movement - which is in opposition to the Law and Justice government. Many proposals of Law and Justice government are not far-right but social - program 500+ mentioned in the article is just one of them. The government has introduced banking tax and works on changes in personal taxes to increase payments by the high income taxpayers. The Law and Justice government has also not withdrawn any of controversial decisions of previous government including very liberal in vitro regulations. Also the proposal to change abortion law was not a governmental draft, wasn't Law and Justice idea and was not supported by the government. It was an civic initiative.<br/>The suggestion that 'Law and Justice had set about to dismantling many of the structural checks and balances designed to prevent a return to the authoritarianism of the Soviet era' is not supported by any facts. There is no violation of free speech or freedom of manifestations. Most of media is in private hands and they are free to criticise the government and Kaczynski. Constitutional Tribunal (TC) is not the highest court in Poland (this is Supreme Court). TC ignored and breached the laws adopted by the parliament even though the laws are binding until they are found unconstitutional.", "createDate": "1478459454", "recommendations": 8, "updateDate": "1478471651", "commentTitle": "<br/>", "userID": 73957933, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "20376747", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1478471651", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 20376747, "replyCount": 0, "editorsSelection": false}