{"commentSequence": 20484766, "userLocation": "Maryland", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Marian", "status": "approved", "userURL": "NULL", "commentBody": "Personally I am a media and news junkie and I visit the Breitbart web page on a regular basis. Many of the headlines you will find there fall under the category of somewhat outrageous click bait. Many of the \"racist\" articles that are being attributed to Mr. Bannon were not in fact written by him but by others who write and contribute to the web site. For example the Breitbart   article that described Bill Kristol in an offensive manner was in fact written by David Horowitz not Stephen Bannon. The right to say and to write offensive and even horrible things is enshrined in our Constitution. This is not to suggest that I believe that anything Mr.Bannon has said or written is horrible.I  do believe that there are those among us that cannot stand to be exposed to a differing point of view particularly when it concerns touchy topics such as race or gender or religion.If Mr. Bannon is guilty of anything it is of providing a space where people can openly and honestly express controversial points of view. I do not see that as a bad thing. As far as President Elect Trump is concerned It is a point of fact that what he just accomplished by winning this presidential election is a major  achievement that most of the established media never saw coming. Stephen Bannon played a major role in assisting him with that achievement and as such it makes perfect sense that Donald Trump would want to continue to seek his advice and counsel as he moves his team into the oval office.", "createDate": "1479168038", "recommendations": 25, "updateDate": "1479224487", "commentTitle": "<br/>", "userID": 68447729, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "20484766", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1479173427", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 20484766, "replyCount": 11, "editorsSelection": true}