{"commentSequence": 20538878, "userLocation": "California", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Sachi G", "status": "approved", "userURL": "NULL", "commentBody": "Yes, two Trump Towers in Turkey...thank you, Gail for your sense of the absurd.  And they had a problem with charitable donations to the Clinton Foundation while Hillary was Secretary of State--  \"It's the appearance of impropriety!\" \"Lock her up!\" they chanted.<br/><br/>I can't wait to watch the President-elect two-step the business of his indebtedness to foreign banks.  <br/><br/>Thus far, nihilism has resolved everything for Mr. Trump. Anything that doesn't light up his personal radar, or which might hold him back, he invalidates - it's peanuts! Whatever it is -- diplomatic protocol, history, science, precedent, context of any kind, geography, ideals, truth-- What, him worry about the state of midtown Manhattan? <br/><br/>It all seems so strange and untethered, like a Marx Brothers movie -- Groucho et al. infiltrate, and do their best to overturn and frustrate the organized conduct of, high society, producing and ripping up contracts, crashing parties, mocking expectations, treating manners as pretentious, sophistication and intellect as foppery, and foreign diplomats as bureaucrats with funny accents.  Just picture Groucho, with his \"socks up on the ottoman\" as Gail puts it, taking British Prime Minister Theresa May's call. Pick any of Gail's choices as topics - A,B,C or D.  It makes a lot more sense that way.    ", "createDate": "1479553357", "recommendations": 164, "updateDate": "1479562975", "commentTitle": "<br/>", "userID": 73798047, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "20538878", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1479562975", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 20538878, "replyCount": 4, "editorsSelection": true}