{"commentSequence": 20538845, "userLocation": "Oregon", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Thoughtful Woman", "status": "approved", "userURL": "NULL", "commentBody": "If the Russians can hack the DNC and the Clinton campaign, you can be sure they've hacked Trump and his coterie.<br/><br/>When he breaks with protocol and calls out from an unsecured location, he'll get to say he's just bucking the establishment and get away with it among his followers.<br/><br/>But when Hillary uses a private server while in office, she's done horrible, bad, crooked, criminal things.  Lock her up.<br/><br/>The double standard is so blatant it's hardly worth pointing out.  This is a man who also just settled a fraud suit against real Americans who bought the Trump U con, who has used his foundation to self deal with other people's money, who encouraged an enemy to interfere in our election, who has profited from his fellow investors' severe losses to zero out his federal tax debt over many years, and whose business and family conflicts of interest are legion.<br/><br/>And he gets away with calling Hillary a crook who endangered national security?  Irony is surely dead.<br/><br/>News for The Donald: The Vlad is listening in at Trump Tower and he is not now, nor will he ever be your friend.  When he wants to roll you, he will.  On every register of the Machiavellian scale, he outscores you: in viciousness, in score settling, in smug disinformation, in dirty tricks.  There's no safe reality TV show called \"Dancing with the Vlad.\"  When Putin feels like it, he'll drop some transcripts of your phone conversations and then deny it was him.  It will be \"Dancing with the Devil,\" cancelling your show.", "createDate": "1479552910", "recommendations": 577, "updateDate": "1479562796", "commentTitle": "<br/>", "userID": 55102361, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "20538845", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1479562796", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 20538845, "replyCount": 2, "editorsSelection": true}