{"commentSequence": 20540946, "userLocation": "NYC", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "BoRegard", "status": "approved", "userURL": "NULL", "commentBody": "First off, Christie cant crawl. He might roll, but no way can he go all four on the floor and cover ground. <br/><br/>\"Trumps\" in the White House...scary. Exactly what will be their decorating POV? To gild everything? Install floor to ceiling mirrors everywhere?  What do we suppose Melania's perspective on American history will be when the decorators come calling? \"Civil what?\" \"How come Hamilton isn't a brown-man like in the play?\" <br/><br/>I cant imagine Donald will want paintings of any other, much more dignified and important men hanging around, reminding him of what a neophyte he is. <br/><br/>What about the Resolute desk in the Oval? Too old? Where are the requisite gilded \"claws\"on the legs? <br/><br/>America's House is in grave danger from a man with no real knowledge of, nor respect for history. Who prefers bulldozers over restoration. Married to a women, who when it was time to shine used the eloquent words of her predecessor and has shown nothing of an engaging personality, or altruistic career goals. Who will be forced to adopt an agenda...likely from a du jour menu provided to her by Donald, and/or Ivanka. <br/><br/>What a disappointment the Trumps will be after 8 years of the dignified and wholly engaging Obama family. (Can't they stay, so to protect the sanctity of that truly American holy ground?)<br/><br/>I think those of us who love the White House, and have been waiting to visit after the recent restoration, better get there soon...because who knows what the Fifth Ave. bumpkins are gonna do to it.", "createDate": "1479566218", "recommendations": 157, "updateDate": "1479570460", "commentTitle": "<br/>", "userID": 73746179, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "20540946", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1479570460", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 20540946, "replyCount": 0, "editorsSelection": true}