{"commentSequence": 20541671, "userLocation": "New Jersey", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "ACW", "status": "approved", "userURL": "NULL", "commentBody": "'The bottom line is that there does not appear to be a plan.'<br/>Trump's like the dog who chased the car, caught it, and is now at a loss for what to do with it. He's not really interested in governing; he just wants to walk down the carpet while they play Hail to the Chief, sit behind the desk, and wear the Special President Hat and eat ice cream until his parents come to the police station to get him. Which suggests he'll leave the actual governing to his henchmen, in which case, seeing his selections so far, be afraid, be very afraid. I suspect this pleases the 'mainstream' GOP, who backed away crying \"#neverTrump' because they figured he'd lose, not because they were really morally appalled. He will strut and fret, and they will carry on business as usual.<br/>I'm surprised Ms Collins didn't mention Trump's indignant tweet after the cast of Hamilton upbraided Pence. \"The Theatre should always be a safe and special place\", tweeted The Donald. Presumably with Play-Doh, chocolate milk, and teddy bears for the traumatized VP.<br/>Seriously, anyone who's looking for a safe place should look almost anywhere but the theatre, as playwrights from Euripides to - well, to Lin-Manuel Miranda could tell Trump.<br/>Admittedly the audience booing Pence were rude, though within their First Amendment rights. The cast, though, thanked Pence, who as a career pol has a sturdier ego than his boss, for staying to listen to their post-curtain address, which was thoughtful and respectful on both parties' part.", "createDate": "1479569742", "recommendations": 165, "updateDate": "1479572781", "commentTitle": "<br/>", "userID": 51865147, "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5186/5147/cropped-51865147.jpg?184398341283603325", "depth": 1, "replies": [], "permID": "20541671", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1479572781", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 20541671, "replyCount": 0, "editorsSelection": true}