{"commentSequence": 20767285, "userLocation": "Annapolis, MD", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Boesephus", "status": "approved", "userURL": "NULL", "commentBody": "Thanks for bringing this to national attention.  It is such a joke and perversion of the service academies' mission.  You bring up some very good points.  One additional point is that the Naval Academy, along with other academies I suppose, do something else - they give undersized and/or slower players who qualify academically an extra year to mature by parking them in NAPS.  Having read the Annapolis Capital newspaper for years - you see phrases like - \"National Merit Scholar who is undersized will attend NAPS before going to the Naval Academy.\"  <br/><br/>Yup, that actually happens - athletes who qualify academically, but may not have a place on team because of his or size or speed goes to NAPS to get bigger and faster. <br/><br/>Another point - local newspaper 2014-15 class which ironically included Zach Abey graduate of a good academic private school called Archbishop Spaulding which is just north of Annapolis -<br/><br/>\"That certainly wasn't the case this year. Only five of the 50 players that spent the 2014-2015 school year at the Naval Academy Prep School did not wind up in Annapolis. Coach Ken Niumatalolo said that was the lowest level of attrition of prep school prospects during his 18 years at the academy.\" <a href=\"http://www.capitalgazette.com/news/annapolis/ph-ac-cs-navy-fball-notes-081715-20150816-story.html\" title=\"http://www.capitalgazette.com/news/annapolis/ph-ac-cs-navy-fball-notes-081715-20150816-story.html\" target=\"_blank\">http://www.capitalgazette.com/news/annapolis/ph-ac-cs-navy-fball-notes-0...</a><br/>So for that year the football team had 45 players arrive at the Academy to play football, one year bigger and faster. ", "createDate": "1481430487", "recommendations": 0, "updateDate": "1481436195", "commentTitle": "<br/>", "userID": 78158118, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "20767285", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1481436195", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 20767285, "replyCount": 0, "editorsSelection": false}