{"commentSequence": 17066790, "userLocation": "Daytona Beach, Florida", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "David", "status": "approved", "userURL": "NULL", "commentBody": "I am also gay and am more \"self-identified\" than out of the closet. When people casually assume I'm straight I don't always have the time or even care enough to correct them. Like the referee in this article I'm more likely to identify my sexuality when I hear a homophobic remark. I think it is sad that me and my fiance self correct ourselves in public. we never hold hands, hug, or even give one another a peck on the cheek. Granted we do not live in the middle of a gay neighborhood etc but I think it is outrageous that in 2015 in America my fiance and I cannot realistically hold hands in public without being gawked at.", "createDate": "1451405009", "recommendations": 23, "updateDate": "1451411090", "commentTitle": "<br/>", "userID": 67450193, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [{"commentSequence": 17071936, "userLocation": "Albany NY", "userTitle": "NULL", "parentID": 17066790, "sharing": 1, "userDisplayName": "PK Miller", "status": "approved", "userURL": "NULL", "commentBody": "My husband would kill me if we held hands in public! He rather hates \"public displays of affection,\" for us or anyone else--regardless of sexuality! I'm probably more \"out\" than he is. Everyone at the college where he teaches knows but no one cares. Same at the college where I taught &amp; Bank of America where I worked for 15 years.<br/>Then too, we are both musicians. He's the quiet, shy bass, I'm the wild &amp; crazy tenor! :)<br/>Out/\"self-identified, what does it matter. Sounds like what our Chasid friends call \"pilpul,\" hairsplitting! ", "createDate": "1451431275", "recommendations": 1, "updateDate": "1451792193", "commentTitle": "<br/>", "userID": 14025852, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 2, "replies": [], "permID": "17066790:17071936", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1451792193", "trusted": 0, "commentType": "userReply", "parentUserDisplayName": "David", "commentID": 17071936, "replyCount": 0, "editorsSelection": false}, {"commentSequence": 17100163, "userLocation": "New York City", "userTitle": "NULL", "parentID": 17066790, "sharing": 1, "userDisplayName": "NYCMattman", "status": "approved", "userURL": "NULL", "commentBody": "I agree. It is outrageous and I share your sadness. But the only way this will change is if LGBTQ individuals start to push those boundaries your mentioned and not self-censor and show some everyday, very average, totally normal love and tenderness in public (I think it's more self-censoring than self-correcting). Is it fair? Absolutely not. Do you need to be the ones who put yourselves in uncomfortable or even dangerous situations for the good of others? Nope, you do not. But fair or not, the public needs this exposure to learn and grow. I don't suggest exaggerated PDA for the sake of PDA. I mean merely that LGBTQ people not censor authentic words or actions in situations that ordinarily require no censorship by anyone else. My experience with my husband (we're two men) has generally been positive. Most people don't notice or frankly care. Those that don't like it rarely make their views known to us, fortunately. Those that do make us feel lousy but whatever. You get on with it. And for every jerk there are 100 terrific people out there.<br/><br/>The less censorship the better. It makes an impact and exposure is one of the only ways for non-LGBTQ people can learn. And with that comes a safer society for LGBTQ people. We can't rely on ABC's Modern Family to change the world. LGBTQ people need to put some skin in the game where and when it can be safely done or change will not happen. It's not fair. It's life.", "createDate": "1451771083", "recommendations": 2, "updateDate": "1451792530", "commentTitle": "<br/>", "userID": 1890744, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 2, "replies": [], "permID": "17066790:17100163", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1451792530", "trusted": 0, "commentType": "userReply", "parentUserDisplayName": "David", "commentID": 17100163, "replyCount": 0, "editorsSelection": false}], "permID": "17066790", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1451411090", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 17066790, "replyCount": 2, "editorsSelection": false}