{"commentSequence": 18721261, "userLocation": "Minneapolis", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Michael", "status": "approved", "userURL": "NULL", "commentBody": "Thank you for this beautifully written story and tribute to a wonderful person. <br/><br/>I first heard about John Kundla in the 70s, when I saw the encased basketball championship trophies at Ascension grade school, which I attended. Later, as a student at De La Salle high school, I was fascinated looking at old yearbook pictures of early powerhouse teams that Mr. Kundla coached. <br/><br/>In the mid-80s, I attended a Fall Festival at Ascension which included a white elephant sale; I was shocked to see they were selling a large box containing the old trophies. I tried to explain their significance, but was told they no longer had room for them, and were about to throw them out. So I bought the trophies for a nickel apiece and took them home. Eventually, I had no room for them either, so I pulled them all out and organized them for a final picture before tossing them. <br/><br/>20  years later, I was visiting our dear family friend Adeline in the same assisted living facility where it turns out Mr. Kundla lives. We were having lunch in the cafeteria, and she insisted that I meet the 'Coach', which is what many of the residents call him. I was puzzled as to who she was referring to, but then the introduction was made, and we clicked instantly, having a great conversation about sports and our mutual connections.<br/><br/>He chuckled and shrugged when I told him about the trophies. We chatted some more, and he invited me to visit again. A kind man and true champion in life!", "createDate": "1464939517", "recommendations": 9, "updateDate": "1464990036", "commentTitle": "<br/>", "userID": 59078445, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "18721261", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1464993636", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 18721261, "replyCount": 0, "editorsSelection": false}