{"commentSequence": 19041771, "userLocation": "Chichester", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Tim Hughes", "status": "approved", "userURL": "NULL", "commentBody": "I may be alone in this opinion, but I don't see this as improving the Warriors. I do see it, however, as extending their reign at the top. The addition of Durant, and the subtraction of Bogut, Ezeli, and Barnes, strengthens the Warriors' areas of strength but also weakens their areas of weakness. Contrary to what Scott Cacciola writes, Durant is not quick enough even to guard most 2s, much less point guards. Nine times out of ten, NBA guards blow past him, although he can recover enough with his length to get a block about once out of those nine times. The rest of the time, however, results in either a layup or a collapse of the defense. He's also not strong enough to guard true big men on an extended basis. About nine times out of ten they simply back him down for a relatively easy post up, although again he can get a steal every so often. With this move, Golden State will still be murder in the regular season and can still go small for short bursts that can break a game open. But in the playoffs, they'll be even more vulnerable to big lineups like Cleveland's (Thompson, Love, and James) or San Antonio's (Gasol/Duncan, Aldridge, and Leonard). It will be VERY entertaining, but my money is still on the field.", "createDate": "1467709866", "recommendations": 3, "updateDate": "1467715403", "commentTitle": "<br/>", "userID": 51224574, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [{"commentSequence": 19050860, "userLocation": "Texas", "userTitle": "NULL", "parentID": 19041771, "sharing": 0, "userDisplayName": "Metastasis", "status": "approved", "userURL": "NULL", "commentBody": "Those guards also blow by LeBron, though he too recovers well. Witness the jaw-dropping block on Iguodala in game 7.   It has always been a myth that LeBron can guard 5 positions. He is actually pretty lazy on defense, and has the inflated reputation because of his (admittedly astonishing) off-ball feats, like the recovery block.", "createDate": "1467759087", "recommendations": 0, "updateDate": "1467762513", "commentTitle": "<br/>", "userID": 68409180, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 2, "replies": [], "permID": "19041771:19050860", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1467766113", "trusted": 0, "commentType": "userReply", "parentUserDisplayName": "Tim Hughes", "commentID": 19050860, "replyCount": 0, "editorsSelection": false}], "permID": "19041771", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1467719003", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 19041771, "replyCount": 1, "editorsSelection": false}