{"commentSequence": 19043440, "userLocation": "New York, NY", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Rick", "status": "approved", "userURL": "NULL", "commentBody": "OKC's ownership has been cheap for years (starting with the trade of James Harden in 2012 and continuing with the acquisition or non-acquisition of various role players based solely on salary), and its coaching staff never figured out how to mesh Durant's and Westbrook's considerable individuals skills within a truly cohesive unit like GS and San Antonio have done. Viewed from that lens, Durant's move makes a lot of sense. I'm not concerned about chemistry issues for GS because they already have a team-oriented infrastructure in place and because Durant will be eager to fit in. In fact, any issues of cohesion do arise will come from his initial eagerness to be unselfish to the point of throwing off his normal style of play.<br/><br/>However, while adding Durant makes GS next season's title favorites on paper, the following should be kept in mind:<br/><br/>1. You just never know with injuries or other unforeseeable factors (such as the Draymond Green suspension), as we've found out in each of the last two Finals.<br/>2. Somewhere in Bath Township, Ohio is a guy who is probably in his home gym, soaking up all the chatter about how GS is next year's \"overwhelming\" title favorite, putting extra oomph into his workout as he thinks about this and saying to himself \"Oh yeah?\" That guy's name, of course, is LeBron James, who has no doubt made it his mission to remind everyone that Cleveland will not give up its long-awaited and hard-won title without a major fight.", "createDate": "1467728798", "recommendations": 2, "updateDate": "1467727157", "commentTitle": "<br/>", "userID": 42080216, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [{"commentSequence": 19046805, "userLocation": "San Jose, Calif.", "userTitle": "NULL", "parentID": 19043440, "sharing": 0, "userDisplayName": "Charles", "status": "approved", "userURL": "NULL", "commentBody": "Harden was jammed up bad by his own team mates in the playoffs against Golden State.  He took to launching himself into the GS defense beneath the basket, hoping to draw a foul and a coupla free throws.  \"Depending on the kindness of strangers,\" the Blanche du Bois of B-ball..", "createDate": "1467737412", "recommendations": 0, "updateDate": "1467738706", "commentTitle": "<br/>", "userID": 30393754, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 2, "replies": [], "permID": "19043440:19046805", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1467742306", "trusted": 0, "commentType": "userReply", "parentUserDisplayName": "Rick", "commentID": 19046805, "replyCount": 0, "editorsSelection": false}], "permID": "19043440", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1467730757", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 19043440, "replyCount": 1, "editorsSelection": false}