{"commentSequence": 19064956, "userLocation": "Yangon", "userTitle": "NULL", "parentID": null, "sharing": 0, "userDisplayName": "Kaung Sett Lwin", "status": "approved", "userURL": "NULL", "commentBody": "I picked this article because I love basketball. I like everything that concerns with basketball. I also watch NBA playoffs when I am alone and or bored. I also practice playing basketball during my summer too. My favorite team in NBA is the Warriors and I found this article that concerns with the warriors! Kevin Durant, a 27 years old basketball player from the Oklahoma City is going to change to the Warriors. That is a big change. I understand that changing from a place that you use to stay is hard. With Kevin Durant, he thinks that he will improve his skills and team ability. Fans and the coaches says that Durant can help Curry’s roles and Thompson’s roles because Curry and Thompson had to really try their best and think about a lot of attacking plays while they were playing finals with the Cavaliers. I agree with that because Curry and Thompson needed help for their attacks and their defense. I also heard that there were rumors saying that Durant’s move cannot be stable because there was an all-star player, LeBron James who change his team from Cavaliers to Miami Heat, then later he came back to Cavaliers. This is also a risk for Warriors to handle. Overall, I am happy that Warriors got a new all-star player in their team. Warriors also got Curry, Klay Thompson, and Draymond Green. So that means that they got a really strong team. I hope they win in their upcoming seasons. ", "createDate": "1467880603", "recommendations": 1, "updateDate": "1468007765", "commentTitle": "<br/>", "userID": 75987088, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "19064956", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1468011365", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 19064956, "replyCount": 0, "editorsSelection": false}