{"commentSequence": 20050984, "userLocation": "New York, NY", "userTitle": "NULL", "parentID": null, "sharing": 1, "userDisplayName": "Howard F Jaeckel", "status": "approved", "userURL": "NULL", "commentBody": "Although I've lost much of my formerly fanatical interest in baseball over the years, I'll be watching and pulling for the Cubs in this postseason. But I'd just as soon not have to watch the Giants series. It's absurd that the Cubs should have to defeat in a short series (in which anything can happen) a team that they so throughly outplayed (to the tune of 16 more wins) during the long, 162 game regular season. <br/><br/>There are 15 teams in the National League, a perfect size to have two divisions, each with about as many teams as made up the whole league prior to expansion. The wild-card system, no doubt designed to give MLB more games to sell to television, cheapens the championship and takes the thrill out of a down-to-the-wire pennant race.  Who can get too excited about finishing first when all that accords a division winner is home field advantage against a wild-card opponent with a record that may be not much above 500?<br/><br/>Baseball is clearly no longer the national pastime, and I don't think that's unrelated to the \"innovations\" in the game adopted by the suits: wild-card games, the designated hitter, regular-season inter-league play, and scheduling World Series games so late that school kids can't stay up to watch. No doubt the owners are serving their short-term financial interests, but it may be at the cost of developing the fan base on which their future depends. ", "createDate": "1475857004", "recommendations": 2, "updateDate": "1475859360", "commentTitle": "<br/>", "userID": 46896334, "picURL": "https://graphics8.nytimes.com/images/apps/timespeople/none.png", "depth": 1, "replies": [], "permID": "20050984", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1475862960", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 20050984, "replyCount": 0, "editorsSelection": false}