{"commentSequence": 20074254, "userLocation": "chicago", "userTitle": "NULL", "parentID": null, "sharing": 1, "userDisplayName": "jerry pritikin", "status": "approved", "userURL": "NULL", "commentBody": "The  real everyday Cubs fan(like me) have been priced out of the ballpark at the face value of a ticket. The Cubs everyday fans who helped give Wrigley Field, the nickname as the\"Friendly Confines\" does not hold true anymore and priced out of the park. The bleachers where known as the cheap seats, do not exist anymore. Bill Veeck said after roaming the ballpark for over 20 years, he found by inverse proportions what a fan paid for his ticket, was their knowledge of the game.  I boycotted Wrigley in 1991 when they raised the price of the Bleachers from $4. to $6 bucks.  Many Cubs fans became fanatics by watching the Cubs on WGN-TV who used to televise every Cubs game over a public station... Now, many of their games are only on cable and pay to see systems. My dad used to tell me that during the depression, at least a fan could still afford go to a game (or movie)!<br/><br/>I became one of those fable fans of the Bleachers, and was tabbed by Harry Caray as the Cubs #1 fan, and was a guest on his 10th inning show, and he introduced me as John Q. Public-the fan! Even the N.Y. Times wrote about me for reminding people not to wear ties in the bleachers and my most important of my 10 Cub-Mandments is # 8, Thou shall not start of participate in the Wave at Wrigley or you will be Ex-Cubmunicated. I sold naming  rights to my back for $1,000 on8/8/88(noted by NYT) and that bought me 3 years worth of bleacher seats,now that would be a weekend with the Brewers. However,I am still a Cubs fan!", "createDate": "1476024650", "recommendations": 0, "updateDate": "1476111045", "commentTitle": "<br/>", "userID": 53245671, "picURL": "https://s3.amazonaws.com/pimage.timespeople.nytimes.com/5324/5671/cropped-53245671.jpg?148782003151138", "depth": 1, "replies": [], "permID": "20074254", "recommendedFlag": null, "timespeople": 1, "reportAbuseFlag": null, "approveDate": "1476114645", "trusted": 0, "commentType": "comment", "parentUserDisplayName": null, "commentID": 20074254, "replyCount": 0, "editorsSelection": false}